---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructure.MinimumSampleHeight
source: html/fe47d724-5e94-dc16-903b-3f2dc51e3c56.htm
---
# Autodesk.Revit.DB.CompoundStructure.MinimumSampleHeight Property

The minimum sample height determined by the current sample height and the horizontal segments.

## Syntax (C#)
```csharp
public double MinimumSampleHeight { get; }
```

## Remarks
All horizontal segments dimensioned to the top must remain strictly above all horizontal segments
 dimensioned to the bottom.